define([], function () {

    var NG_WORDS = ["070", "０７０", "080", "０８０", "090", "０９０", "disney.ne.jp", "docomo.ne.jp", "emnet.ne.jp", "ezweb.ne.jp", "pdx.ne.jp", "softbank.ne.jp", "vodafone.ne.jp", "willcom.com", "docomo", "ｄｏｃｏｍｏ", "ドコモ", "ﾄﾞｺﾓ", "ezweb", "ｅｚｗｅｂ", "いーじーうぇぶ", "イージーウェブ", "ｲｰｼﾞｰｳｪﾌﾞ", "softbank", "ｓｏｆｔｂａｎｋ", "そふとばんく", "ソフトバンク", "ｿﾌﾄﾊﾞﾝｸ", "vodafone", "ｖｏｄａｆｏｎｅ", "ぼーだふぉん", "う゛ぉーだふぉん", "ボーダフォン", "18禁", "１８禁", "AV", "JC", "JK", "sex", "SMクラブ", "Tバック", "アダルト", "ｱﾀﾞﾙﾄ", "あだると", "アナル", "ｱﾅﾙ", "あなる", "いーじーうぇぶ", "イージーウェブ", "ｲｰｼﾞｰｳｪﾌﾞ", "ｲﾁﾓﾂ", "いちもつ", "イチモツ", "ｲﾒｸﾗ", "いめくら", "イメクラ", "ｲﾗﾏﾁｵ", "いらまちお", "イラマチオ", "ｲﾝﾗﾝ", "いんらん", "インラン", "ヴぁぎな", "ヴァギナ", "ｳﾞｧｷﾞﾅ", "ウリ専", "ｳﾘ専", "ｴ○ﾁ", "え○ち", "エ○チ", "エ◎チ", "エ●チ", "エ☆チ", "エ★チ", "えすえむくらぶ", "エスエムクラブ", "ｴｯﾁ", "えっち", "エッチ", "ｴﾈﾏｸﾞﾗ", "えねまぐら", "エネマグラ", "ｴﾛ", "えろ", "エロ", "エロアニメ", "えろあにめ", "ｴﾛ画像", "エロ画像", "ｴﾝｺｳ", "えんこう", "エンコウ", "ｴﾝｼﾞｮｺｳｻｲ", "えんじょこうさい", "エンジョコウサイ", "おちんちん", "おちんぽ", "おっぱい", "オッパイ", "ｵｯﾊﾟｲ", "ｵﾅｸﾗ", "おなくら", "オナクラ", "オナニー", "ｵﾅﾆｰ", "おなにー", "ｵﾅﾎ", "おなほ", "オナホ", "ｵﾅﾎｰﾙ", "おなほーる", "オナホール", "おぱーい", "オパーイ", "ｵﾊﾟｰｲ", "ｵﾌﾞﾂ", "おぶつ", "オブツ", "オフ会", "おめこ", "オメコ", "お小遣い", "お宝", "お宝画像", "ガールズコム", "ｶｲｼｭﾝ", "かいしゅん", "カイシュン", "ｶﾞﾁｬﾒ", "彼女募集", "カノジョ募集", "ｶﾉｼﾞｮ募集", "カレカノ", "彼氏募集", "カレシ募集", "ｶﾚｼ募集", "ｶﾞﾝｼｬ", "がんしゃ", "ガンシャ", "ｷﾁｶﾞｲ", "きちがい", "キチガイ", "キメセク", "ｷﾒｾｸ", "キメ友", "ｷﾒ友", "ｷﾞｬｸｴﾝ", "ぎゃくえん", "ギャクエン", "逆援", "ｷｮｺﾝ", "きょこん", "キョコン", "巨根", "ギリギリ画像", "クリトリス", "ｸﾘﾄﾘｽ", "くりとりす", "グロ", "クンニ", "クンニリングス", "現役女子大生", "ココカノ", "ｺｺｶﾉ", "ココカレ", "ｺｺｶﾚ", "ｺｽｴｯﾁ", "こすえっち", "コスエッチ", "ｺﾞｯｸﾝ", "ごっくん", "ゴックン", "こむして", "コムして", "コムしょ", "こむしよ", "コムしよ", "こむとも", "こむもち", "コムもち", "コムろ", "こむ持ち", "コム持ち", "こむ友", "ｺﾑ有", "コム有", "ｺﾑ有り", "コム有り", "ｺﾝﾄﾞｰﾑ", "こんどーむ", "コンドーム", "ｻｼｱﾎﾟ", "さしあぽ", "サシアポ", "ｻｾｺ", "させこ", "サセコ", "サセ子", "ｻﾌﾞｱﾄﾞ", "さぶあど", "サブアド", "サンプル動画", "ｻﾝﾌﾟﾙ動画", "潮吹", "ｼｵﾌｷ", "しおふき", "シオフキ", "下ネタ", "ｼｬｾｲ", "シャセイ", "射精", "ｼｭｲﾝ", "しゅいん", "シュイン", "ｼｮｼﾞｮ", "しょじょ", "ショジョ", "処女", "ｼｮﾀ", "しょた", "ショタ", "ｼﾞｮﾁｭｳ", "じょちゅう", "ジョチュウ", "ｼﾗｯｺ", "しらっこ", "シラッコ", "スカトロ", "すかとろ", "ｽｶﾄﾛ", "スク水", "ｽﾄﾘｯﾌﾟ", "すとりっぷ", "ストリップ", "ｾｲｺｳｲ", "せいこうい", "セイコウイ", "性行為", "ｾｲｽｲ", "せいすい", "セイスイ", "セクース", "ｾｸｰｽ", "せくーす", "ｾｸｷｬﾊﾞ", "せくきゃば", "セクキャバ", "セクシー", "セクシー画像", "セクフレ", "ｾｸﾌﾚ", "セクロス", "ｾｸﾛｽ", "セックス", "ｾｯｸｽ", "せっくす", "セックル", "ｾｯｸﾙ", "セフレ", "ｾﾌﾚ", "せふれ", "ｾﾝｽﾞﾘ", "せんずり", "センズリ", "ｿｰﾌﾟ", "そーぷ", "ソープ", "ｿｰﾌﾟﾗﾝﾄﾞ", "そーぷらんど", "ソープランド", "そふとばんく", "ﾀﾞｯﾁﾜｲﾌ", "だっちわいふ", "ダッチワイフ", "ﾀﾝｼｮｳ", "たんしょう", "タンショウ", "ち○こ", "チ○コ", "ち○ぽ", "チ○ポ", "ﾁｼﾞｮ", "ちじょ", "チジョ", "直アド", "直ｱﾄﾞ", "直アドレス", "直ｱﾄﾞﾚｽ", "直メ", "直ﾒ", "ちょくメイル", "ちょくめいる", "チョクメイル", "チョクめいる", "直メール", "直ﾒｰﾙ", "ちょくメール", "ちょくめーる", "チョクメール", "チョクめーる", "ﾁﾝｺ", "ちんこ", "チンコ", "チンチン", "ﾁﾝﾁﾝ", "ちんちん", "チンポ", "ちんぽ", "ﾁﾝﾎﾟ", "チンポ", "痴女", "ﾂﾂﾓﾀｾ", "つつもたせ", "ツツモタセ", "ﾂﾝﾎﾞ", "つんぼ", "ツンボ", "出会い系", "ティムポ", "ﾃｨﾑﾎﾟ", "ティンポ", "ﾃｨﾝﾎﾟ", "ﾃﾞﾌﾞｽ", "でぶす", "デブス", "ﾃﾞﾘﾍﾙ", "でりへる", "デリヘル", "テルカノ", "ﾃﾙｶﾉ", "テルカレ", "ﾃﾙｶﾚ", "ﾃﾚｸﾗ", "てれくら", "テレクラ", "テレセ", "ﾃﾚｾ", "ﾄｳｻﾂ", "とうさつ", "トウサツ", "盗撮", "ﾄﾞｳﾃｲ", "どうてい", "ドウテイ", "ﾅｶﾀﾞｼ", "なかだし", "ナカダシ", "中出し", "ﾈﾄﾅ", "ねとな", "ネトナ", "ﾈﾄﾅﾝ", "ねとなん", "ネトナン", "ﾈﾅﾍﾞ", "ねなべ", "ネナベ", "ネ申待ち", "ﾊﾞｲﾀ", "ばいた", "バイタ", "ぱいぱん", "パイパン", "ﾊﾟｲﾊﾟﾝ", "ハメ撮り", "ハメ写", "ﾊﾒ写", "パンチラ", "ﾊﾟﾝﾁﾗ", "ﾋﾜｲ", "ひわい", "ヒワイ", "卑猥", "ピンサロ", "ファック", "フーゾク", "ﾌｰｿﾞｸ", "フェチ", "フェラ", "フェラチオ", "フェ有", "ﾌｪ有", "プチ援", "ﾌﾟﾁ援", "プチ家出", "ﾍﾟﾆｽ", "ぺにす", "ペニス", "ﾍﾙｽ", "へるす", "ヘルス", "ﾎﾞｰｲｽﾞﾗﾌﾞ", "ぼーいずらぶ", "ボーイズラブ", "ﾎﾞｯｷ", "ぼっき", "ボッキ", "ﾎﾃﾄﾙ", "ほてとる", "ホテトル", "ﾎﾃﾍﾙ", "ほてへる", "ホテヘル", "ﾎﾟﾙﾉ", "ぽるの", "ポルノ", "ま○こ", "マ○コ", "マンコ", "まんこ", "ﾏﾝｺ", "マン汁", "まん汁", "ﾑｼｭｳｾｲ", "むしゅうせい", "ムシュウセイ", "ムネチラ", "ﾑﾈﾁﾗ", "ﾒﾙｶﾉ", "めるかの", "メルカノ", "ﾒﾙｶﾚ", "めるかれ", "メルカレ", "メル友", "ﾒﾝﾍﾗ", "めんへら", "メンヘラ", "ヤリコン", "ﾔﾘｺﾝ", "ヤリサー", "ﾔﾘｻｰ", "ﾔﾘﾁﾝ", "やりちん", "ヤリチン", "ヤリ友", "ヤリトモ", "やりとも", "ヤリマン", "ﾔﾘﾏﾝ", "やりまん", "ﾔﾘﾓｸ", "やりもく", "ヤリモク", "ヤリ部屋", "ﾔﾘ部屋", "ﾔﾘ友", "ライブチャット", "ﾗｲﾌﾞﾁｬｯﾄ", "ラブドラッグ", "ﾗﾌﾞﾄﾞﾗｯｸﾞ", "ﾗﾝﾊﾟﾌﾞ", "らんぱぶ", "ランパブ", "リアかの", "りあかの", "リアカノ", "りあカノ", "リアかれ", "りあかれ", "リアカレ", "りあカレ", "リア彼", "りあ彼", "レイパー", "ﾚｲﾊﾟｰ", "れいぱー", "れいぷ", "レイプ", "ﾚｽﾞ", "れず", "レズ", "ﾚﾝﾀﾝ", "ﾛﾘｰﾀ", "ろりーた", "ロリータ", "ロリコン", "ﾛﾘｺﾝ", "ろりこん", "愛撫", "淫売", "淫乱", "円交", "円光", "円女", "援希望", "援交", "援交際", "援助交際", "汚物", "嫁さん募集", "花嫁募集", "顔射", "逆￥", "逆逆サポ", "逆ｻﾎﾟ", "巨乳", "胸チラ", "胸ﾁﾗ", "現役女子高生", "現役小学生", "現役中学生", "高①", "高②", "高③", "高校生", "婚活", "撮影会", "姉汁", "自慰", "手コキ", "手ｺﾐ", "手マン", "手ﾏﾝ", "手淫", "汁男優", "出逢い系", "出逢系", "出会い", "小①", "小②", "小③", "小④", "小⑤", "小⑥", "小学生撮影", "神待ち", "人妻", "性器", "性交", "聖水", "青姦", "千摺り", "素股", "即アポ", "即ハメ", "即ﾊﾒ", "即マン", "即ﾏﾝ", "即ヤリ", "即ﾔﾘ", "体位", "大人のお付き合い", "大人の付き合い", "大麻", "短小", "男根", "男性器", "痴漢", "着エロ", "中①", "中②", "中③", "中学生", "潮ふき", "潮フキ", "潮吹き", "直ぁど", "直ぁド", "直ァド", "直あど", "直し", "直ｼ", "直メイル", "直めいる", "直めーる", "童貞", "肉棒", "買春", "売春", "売女", "泊め男", "爆乳", "美人局", "部落", "風俗", "変態", "包茎", "勃起", "無修正", "無料動画", "幼女", "乱交", "恋人募集", "露出チャット", "露出掲示板", "死にたい", "死ぬ", "死にます", "死にましょう", "死にませんか", "自殺", "死ね", "シネ", "氏ね", "殺す", "殺害する", "殺したい", "爆発しろ", "皆殺し", "うざい", "ウザい", "ｳｻﾞい", "ぅざい", "ｩｻﾞい", "ゥザい", "ｷﾓｲ", "キモい", "ｷﾓｰｲ", "キモーい", "馬鹿", "ﾊﾞｶ", "バカ", "バーカ", "ﾊﾞｰｶ"];



    var NGWord = {};


    /**
     * 渡した値がNGワードに含まれているかチェック
     * @param  {string} string [description]
     * @return {boolean}        [description]
     */
    NGWord.check = function (string) {
        var i,n;
        var ngWord;
        var index;
        var isNGWord = false;
        ngwords = ngwords || NG_WORDS;

        for (i = 0, n = ngwords.length; i < n; i++) {
            ngWord = ngwords[i];
            index = string.search( new RegExp(ngWord, 'i' ) );

            if (index >= 0) {
                isNGWord = true;
                break;
            }
        }
        return isNGWord;
    };




	return NGWord;
});
